run/tutorials/JetFlameH2/steady-openfoam4/01-ED-1step/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                        	 none;
    div(phi,U)                     	 bounded Gauss upwind;
    div(phi,h)                     	 bounded Gauss upwind;
    div(phi,epsilon)               	 bounded Gauss upwind;
    div(phi,k)                     	 bounded Gauss upwind;
    div(phi,K)                     	 bounded Gauss upwind;
    div(phi,Yi)                    	 Gauss limitedLinear01 1;
    div(((rho*nuEff)*dev2(T(grad(U)))))  Gauss linear;
}

laplacianSchemes
{
    default         			Gauss linear corrected;
}

interpolationSchemes
{
	default         	    none;
	interpolate((rho*HbyA))     linear;
	interpolate(rho)  	    linear;
	interpolate((rho*(1|A(U)))) linear;
        flux((rho*HbyA))            linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
